x1, y1, z1 = [float(i) for i in input('Введите координаты 1 точки через пробел: ').split( )]
x2, y2, z2 = [float(i) for i in input('Введите координаты 2 точки через пробел: ').split( )]
x3, y3, z3 = [float(i) for i in input('Введите координаты 3 точки через пробел: ').split( )]
x4, y4, z4 = [float(i) for i in input('Введите через пробелvкоординаты 4 точки, от которой \n'
                   'считаем расстояние:  ').split( )]

# | x-x1   y-y1    z-z1 |
# | x2-x1  y2-y1  z2-z1 | = 0
# | x3-x1  y3-y1  z3-z1 |

# distance - расстояние
# d - слагаемое в уравнении плоскости

a = -((y2 - y1) * (z3 - z1) - (y3 - y1) * (z2 - z1))
b = ((x2 - x1) * (z3 - z1) - (x3 - x1) * (z2 - z1))
c = -((x2 - x1) * (y3 - y1) - (x3 - x1) * (y2 - y1))
d = -(x1 * a + y1 * b + z1 * c)

print(a, b, c, d)
distance = (abs((a * x4) + (b * y4) + (c * z4) + d) / (((a ** 2) + (b ** 2) + (c ** 2)) ** (1 / 2)))

print('\nМатрица плоскости,проходящей через 3 точки:')

print(f"| \t x-{x1} \t y-{y1} \t z-{z1} \t | \n"
      f"| \t {x2-x1} \t {y2-y1} \t {z2-z1} \t | \n"
      f"| \t {x3-x1} \t {y3-y1} \t {z3-z1} \t | \n")

print('Расстояние от точки 4 до плоскости по нормали d= ', round(distance,3))
