x1, y1, z1 = input('Введите координаты 1 точки через пробел: ').split( )
x2, y2, z2 = input('Введите координаты 2 точки через пробел: ').split( )
x3, y3, z3 = input('Введите координаты 3 точки через пробел: ').split( )
x4, y4, z4 = input('Введите координаты 4 точки, от которой \n'
                   'считаем расстояние через пробел:  ').split( )

x1= float(x1)
x2= float(x2)
x3= float(x3)
x4= float(x4)
y1= float(y1)
y2= float(y2)
y3= float(y3)
y4= float(y4)
z1= float(z1)
z2= float(z2)
z3= float(z3)
z4= float(z4)

# | x-x1   y-y1    z-z1 |
# | x2-x1  y2-y1  z2-z1 | = 0
# | x3-x1  y3-y1  z3-z1 |



# d - расстояние
# D - слагаемое в уравнении плоскости

A = ((y2 - y1) * (z3 - z1) - (y3 - y1) * (z2 - z1))
B = ((x2 - x1) * (z3 - z1) - (x3 - x1) * (z2 - z1))
C = ((x2 - x1) * (y3 - y1) - (x3 - x1) * (y2 - y1))

s1 = (0 - x1) * A
s2 = (0 + y1) * B
s3 = (0 - z1) * C

D = s1 + s2 + s3

d = (abs((A * x4) + (B * y4) + (C * z4) + D) / (((A ** 2) + (B ** 2) + (C ** 2)) ** (1 / 2)))

print('Матрица плоскости,проходящей через 3 точки:')

print('|','\t','x-',(x1),'\t','y-',(y1),'\t','z-',(z1),'\t','|','\n'
      '|','\t',(x2 - x1),'\t','\t',(y2 - y1), '\t','\t',(z2 - z1),'\t','\t','|', '\n'
      '|','\t',(x3 - x1),'\t','\t',(y3 - y1),'\t','\t',(z3 - z1),'\t','\t','|')
print('Расстояние от точки 4 до плоскости по нормали d= ', round(d,3))
